Rbb666/sdk-bsp-psoc_e84-edgi-talk/projects/Edgi_Talk_M55_RetroGo/applications/retro_go/platform/retro_go_display.c
#include "retro_go_display.h"

#include "retro_go_lcd_api.h"
#include "retro_go_perf.h"
#include "retro_go_platform.h"
#include "retro_go_time.h"

#include <board.h>
#include <rthw.h>
#include <rtdevice.h>
#include <rtthread.h>

#include <string.h>

#include "cy_graphics.h"
#include "vg_lite.h"

#if !defined(BSP_LCD_ROTATION_90) && !defined(BSP_LCD_ROTATION_270)
#error "Retro-Go requires an 800x480 landscape LCD rotation"
#endif

typedef struct retro_go_viewport
{
    uint16_t x;
    uint16_t y;
    uint16_t width;
    uint16_t height;
} retro_go_viewport_t;

#define RETRO_GO_DISPLAY_MAX_WIDTH 800u
#define RETRO_GO_DISPLAY_MAX_HEIGHT 480u
#define RETRO_GO_DISPLAY_MAX_VIEWPORT_WIDTH 534u
#define RETRO_GO_DISPLAY_SCALE_STRIDE_PIXELS 720u
#define RETRO_GO_LAUNCHER_SCALE 2u
#define RETRO_GO_LAUNCHER_OUTPUT_WIDTH \
    (RETRO_GO_LAUNCHER_WIDTH * RETRO_GO_LAUNCHER_SCALE)
#define RETRO_GO_LAUNCHER_OUTPUT_HEIGHT \
    (RETRO_GO_LAUNCHER_HEIGHT * RETRO_GO_LAUNCHER_SCALE)
#define RETRO_GO_GBA_SCALE 3u
#define RETRO_GO_GBA_OUTPUT_WIDTH (RETRO_GO_GBA_WIDTH * RETRO_GO_GBA_SCALE)
#define RETRO_GO_GBA_OUTPUT_HEIGHT (RETRO_GO_GBA_HEIGHT * RETRO_GO_GBA_SCALE)
#define RETRO_GO_GFXRAM_START 0x26200000u
#define RETRO_GO_GFXRAM_END   0x26500000u
#define RETRO_GO_SCANOUT_WIDTH 480u
#define RETRO_GO_SCANOUT_HEIGHT 800u
#define RETRO_GO_SCANOUT_STRIDE_PIXELS 512u

#define RETRO_GO_DISPLAY_THREAD_STACK_BYTES 4096u
#define RETRO_GO_GBA_MAILBOX_BUFFERS 2u

typedef enum retro_go_display_buffer_state
{
    RETRO_GO_DISPLAY_BUFFER_FREE,
    RETRO_GO_DISPLAY_BUFFER_WRITING,
    RETRO_GO_DISPLAY_BUFFER_READY,
    RETRO_GO_DISPLAY_BUFFER_DISPLAYING,
} retro_go_display_buffer_state_t;

#ifndef BSP_RETRO_GO_DISPLAY_THREAD_PRIORITY
#define BSP_RETRO_GO_DISPLAY_THREAD_PRIORITY 26
#endif
#ifndef BSP_RETRO_GO_DISPLAY_THREAD_SLICE
#define BSP_RETRO_GO_DISPLAY_THREAD_SLICE 5
#endif
#ifndef BSP_RETRO_GO_GBA_FLIP_WAIT_MS
#define BSP_RETRO_GO_GBA_FLIP_WAIT_MS 3
#endif

#if defined(CONFIG_USBHOST_PSC_PRIO) && \
    (BSP_RETRO_GO_DISPLAY_THREAD_PRIORITY <= CONFIG_USBHOST_PSC_PRIO)
#error "Retro-Go display worker must remain below USB host priority"
#endif
#if defined(BSP_RETRO_GO_INPUT_THREAD_PRIORITY) && \
    (BSP_RETRO_GO_DISPLAY_THREAD_PRIORITY <= \
     BSP_RETRO_GO_INPUT_THREAD_PRIORITY)
#error "Retro-Go display worker must remain below HID input priority"
#endif
#if defined(RT_MAIN_THREAD_PRIORITY) && \
    (BSP_RETRO_GO_DISPLAY_THREAD_PRIORITY < RT_MAIN_THREAD_PRIORITY)
#error "Retro-Go display worker must not preempt the emulator main thread"
#endif

static uint16_t source_framebuffer[RETRO_GO_GB_WIDTH * RETRO_GO_GB_HEIGHT]
    RETRO_GO_GFXMEM;
static uint16_t launcher_framebuffer[RETRO_GO_LAUNCHER_WIDTH *
                                     RETRO_GO_LAUNCHER_HEIGHT]
    RETRO_GO_GFXMEM;
static uint16_t gba_framebuffer[RETRO_GO_GBA_WIDTH *
                                (RETRO_GO_GBA_HEIGHT + 1u)]
    __attribute__((section(".cy_gba_framebuffer"), aligned(64)));
#ifdef BSP_RETRO_GO_ASYNC_GBA_DISPLAY
static uint16_t gba_present_framebuffer[RETRO_GO_GBA_MAILBOX_BUFFERS]
                                       [RETRO_GO_GBA_WIDTH *
                                        RETRO_GO_GBA_HEIGHT]
    RETRO_GO_GFXMEM;
static struct rt_thread display_thread RETRO_GO_SOCMEM;
static struct rt_semaphore display_sem RETRO_GO_SOCMEM;
static rt_uint8_t display_thread_stack[RETRO_GO_DISPLAY_THREAD_STACK_BYTES]
    RETRO_GO_SOCMEM;
static volatile bool display_async_ready;
static volatile bool display_async_busy;
static volatile bool display_worker_running;
static volatile uint8_t display_buffer_state[RETRO_GO_GBA_MAILBOX_BUFFERS];
#endif
static volatile uint32_t display_submitted_frames;
static volatile uint32_t display_completed_frames;
static volatile uint32_t display_dropped_frames;
static volatile uint32_t display_failed_frames;
static volatile uint64_t display_total_present_cycles;
static volatile uint32_t display_max_present_cycles;
static bool display_present_completed;
typedef union retro_go_display_work_buffer
{
    uint16_t scaled[RETRO_GO_DISPLAY_SCALE_STRIDE_PIXELS *
                    RETRO_GO_DISPLAY_MAX_HEIGHT];
    uint16_t scanout[RETRO_GO_SCANOUT_STRIDE_PIXELS *
                     RETRO_GO_SCANOUT_HEIGHT];
} retro_go_display_work_buffer_t;

static retro_go_display_work_buffer_t display_work_buffer RETRO_GO_GFXMEM
    __attribute__((aligned(128)));
#define scaled_framebuffer (display_work_buffer.scaled)
static uint16_t source_x_map[RETRO_GO_DISPLAY_MAX_VIEWPORT_WIDTH]
    RETRO_GO_DTCM;
static uint16_t source_y_map[RETRO_GO_DISPLAY_MAX_HEIGHT] RETRO_GO_DTCM;
static rt_device_t lcd_device;
static struct rt_device_graphic_info lcd_info;
static retro_go_viewport_t viewport;
static bool display_ready;
#ifdef BSP_RETRO_GO_USE_VGLITE
static bool vglite_failed;
#ifdef BSP_RETRO_GO_GBA_DIRECT_SCANOUT
static bool direct_scanout_failed;
static bool direct_scanout_logged;
static bool direct_scanout_initialized;
static bool direct_scanout_flip_pending;
static bool direct_scanout_buffer_cleared[2];
static uint8_t direct_scanout_front;
static uint8_t direct_scanout_back;
static uint8_t direct_scanout_pending_front;
static uint16_t *direct_scanout_buffers[2];
static cy_stc_gfx_context_t direct_scanout_context;
#ifdef BSP_RETRO_GO_PERF_OVERLAY
static uint32_t direct_panel_revision;
static uint32_t direct_panel_applied_revision[2];
#endif
#endif
#ifdef BSP_RETRO_GO_GBA_DIRECT_RENDER
static bool direct_render_failed;
static bool direct_render_logged;
#endif
#endif

static bool present_gba_sync(const uint16_t *framebuffer);

static RETRO_GO_ITCM bool scale_gba_cpu_direct(const uint16_t *framebuffer)
{
#ifdef BSP_RETRO_GO_GBA_DIRECT_CPU_SCALE
    uint16_t *destination = (uint16_t *)lcd_info.framebuffer;
    uint32_t destination_stride = lcd_info.pitch / sizeof(uint16_t);
    uint16_t y;

    if (framebuffer == NULL || destination == NULL ||
        lcd_info.width < 800u || lcd_info.height < RETRO_GO_GBA_OUTPUT_HEIGHT ||
        lcd_info.pitch < lcd_info.width * sizeof(uint16_t))
    {
        return false;
    }
    for (y = 0u; y < RETRO_GO_GBA_HEIGHT; ++y)
    {
        const uint16_t *source_row =
            framebuffer + (size_t)y * RETRO_GO_GBA_WIDTH;
        uint16_t *first_row =
            destination + (size_t)(y * RETRO_GO_GBA_SCALE) *
                              destination_stride;
        uint16_t x;

        for (x = 0u; x < RETRO_GO_GBA_WIDTH; ++x)
        {
            uint16_t pixel = source_row[x];
            size_t output = (size_t)x * RETRO_GO_GBA_SCALE;

            first_row[output] = pixel;
            first_row[output + 1u] = pixel;
            first_row[output + 2u] = pixel;
        }
        memcpy(first_row + destination_stride, first_row,
               RETRO_GO_GBA_OUTPUT_WIDTH * sizeof(first_row[0]));
        memcpy(first_row + destination_stride * 2u, first_row,
               RETRO_GO_GBA_OUTPUT_WIDTH * sizeof(first_row[0]));
    }
    return true;
#else
    (void)framebuffer;
    return false;
#endif
}

static void stage_performance_panel(void)
{
#ifdef BSP_RETRO_GO_PERF_OVERLAY
    if (lcd_info.width >= RETRO_GO_PERF_PANEL_WIDTH &&
        lcd_info.height >= RETRO_GO_PERF_PANEL_HEIGHT &&
        retro_go_perf_render_due(launcher_framebuffer,
                                 RETRO_GO_PERF_PANEL_WIDTH,
                                 RETRO_GO_PERF_PANEL_HEIGHT,
                                 RETRO_GO_PERF_PANEL_WIDTH))
    {
        lcd_flush_rgb565_area(
            launcher_framebuffer,
            lcd_info.width - RETRO_GO_PERF_PANEL_WIDTH, 0u,
            RETRO_GO_PERF_PANEL_WIDTH, RETRO_GO_PERF_PANEL_HEIGHT,
            RETRO_GO_PERF_PANEL_WIDTH, RT_FALSE);
    }
#endif
}

#ifdef BSP_RETRO_GO_USE_VGLITE
static bool gba_framebuffer_cacheable_range(uintptr_t start, uintptr_t end)
{
#ifdef BSP_RETRO_GO_GBA_FRAMEBUFFER_CACHEABLE
    return start >= (uintptr_t)gba_framebuffer &&
           end <= (uintptr_t)gba_framebuffer + sizeof(gba_framebuffer);
#else
    (void)start;
    (void)end;
    return false;
#endif
}

static void cache_clean(const void *address, size_t size)
{
#if defined(__DCACHE_PRESENT) && (__DCACHE_PRESENT == 1U)
    uintptr_t raw_start = (uintptr_t)address;
    uintptr_t raw_end = raw_start + size;
    uintptr_t start = (uintptr_t)address &
                      ~((uintptr_t)__SCB_DCACHE_LINE_SIZE - 1u);
    uintptr_t end = ((uintptr_t)address + size + __SCB_DCACHE_LINE_SIZE - 1u) &
                    ~((uintptr_t)__SCB_DCACHE_LINE_SIZE - 1u);

    /* Generated MPU region 3 maps all GFXRAM as Normal Non-cacheable.
     * Avoid thousands of redundant 32-byte SCB maintenance operations. */
    if (raw_start >= RETRO_GO_GFXRAM_START &&
        raw_end <= RETRO_GO_GFXRAM_END &&
        !gba_framebuffer_cacheable_range(raw_start, raw_end))
    {
        __DMB();
        return;
    }
    if (rt_hw_cpu_dcache_status() && end > start)
    {
        SCB_CleanDCache_by_Addr((void *)start, (int32_t)(end - start));
    }
#else
    (void)address;
    (void)size;
#endif
}

static void cache_invalidate(void *address, size_t size)
{
#if defined(__DCACHE_PRESENT) && (__DCACHE_PRESENT == 1U)
    uintptr_t raw_start = (uintptr_t)address;
    uintptr_t raw_end = raw_start + size;
    uintptr_t start = (uintptr_t)address &
                      ~((uintptr_t)__SCB_DCACHE_LINE_SIZE - 1u);
    uintptr_t end = ((uintptr_t)address + size + __SCB_DCACHE_LINE_SIZE - 1u) &
                    ~((uintptr_t)__SCB_DCACHE_LINE_SIZE - 1u);

