Rbb666/sdk-bsp-psoc_e84-edgi-talk/projects/Edgi_Talk_M55_RetroGo/applications/retro_go/platform/retro_go_display.c
    if (raw_start >= RETRO_GO_GFXRAM_START &&
        raw_end <= RETRO_GO_GFXRAM_END &&
        !gba_framebuffer_cacheable_range(raw_start, raw_end))
    {
        __DSB();
        return;
    }
    if (rt_hw_cpu_dcache_status() && end > start)
    {
        SCB_InvalidateDCache_by_Addr((void *)start, (int32_t)(end - start));
    }
#else
    (void)address;
    (void)size;
#endif
}
#endif

static retro_go_viewport_t calculate_viewport(uint16_t screen_width,
                                               uint16_t screen_height)
{
    retro_go_viewport_t result;

#ifdef BSP_RETRO_GO_SCALE_INTEGER
    uint16_t scale_x = screen_width / RETRO_GO_GB_WIDTH;
    uint16_t scale_y = screen_height / RETRO_GO_GB_HEIGHT;
    uint16_t scale = scale_x < scale_y ? scale_x : scale_y;

    if (scale == 0u)
    {
        scale = 1u;
    }
    result.width = (uint16_t)(RETRO_GO_GB_WIDTH * scale);
    result.height = (uint16_t)(RETRO_GO_GB_HEIGHT * scale);
#else
    uint32_t width_from_height =
        ((uint32_t)screen_height * RETRO_GO_GB_WIDTH) / RETRO_GO_GB_HEIGHT;

    if (width_from_height <= screen_width)
    {
        result.width = (uint16_t)width_from_height;
        result.height = screen_height;
    }
    else
    {
        result.width = screen_width;
        result.height = (uint16_t)(((uint32_t)screen_width *
                                    RETRO_GO_GB_HEIGHT) /
                                   RETRO_GO_GB_WIDTH);
    }
#endif
    result.x = (uint16_t)((screen_width - result.width) / 2u);
    result.y = (uint16_t)((screen_height - result.height) / 2u);
    return result;
}

static void build_scale_maps(void)
{
    uint16_t coordinate;

    for (coordinate = 0u; coordinate < viewport.width; ++coordinate)
    {
        source_x_map[coordinate] =
            (uint16_t)(((uint32_t)coordinate * RETRO_GO_GB_WIDTH) /
                       viewport.width);
    }
    for (coordinate = 0u; coordinate < viewport.height; ++coordinate)
    {
        source_y_map[coordinate] =
            (uint16_t)(((uint32_t)coordinate * RETRO_GO_GB_HEIGHT) /
                       viewport.height);
    }
}

static bool scale_vglite(const uint16_t *pixels,
                         uint16_t source_width, uint16_t source_height,
                         uint16_t target_width, uint16_t target_height)
{
#ifdef BSP_RETRO_GO_USE_VGLITE
    vg_lite_buffer_t source;
    vg_lite_buffer_t target;
    vg_lite_matrix_t matrix;
    vg_lite_error_t status;

    if (vglite_failed || pixels == NULL || source_width == 0u ||
        source_height == 0u || target_width == 0u || target_height == 0u ||
        target_width > RETRO_GO_DISPLAY_SCALE_STRIDE_PIXELS ||
        target_height > RETRO_GO_DISPLAY_MAX_HEIGHT)
    {
        return false;
    }

    memset(&source, 0, sizeof(source));
    source.width = source_width;
    source.height = source_height;
    source.stride = source_width * sizeof(uint16_t);
    source.format = VG_LITE_RGB565;
    source.tiled = VG_LITE_LINEAR;
    source.image_mode = VG_LITE_NORMAL_IMAGE_MODE;
    source.transparency_mode = VG_LITE_IMAGE_OPAQUE;
    source.memory = (void *)pixels;
    source.address = (uint32_t)(uintptr_t)pixels;

    memset(&target, 0, sizeof(target));
    target.width = target_width;
    target.height = target_height;
    target.stride = RETRO_GO_DISPLAY_SCALE_STRIDE_PIXELS * sizeof(uint16_t);
    target.format = VG_LITE_RGB565;
    target.tiled = VG_LITE_LINEAR;
    target.image_mode = VG_LITE_NORMAL_IMAGE_MODE;
    target.transparency_mode = VG_LITE_IMAGE_OPAQUE;
    target.memory = scaled_framebuffer;
    target.address = (uint32_t)(uintptr_t)scaled_framebuffer;

    cache_clean(pixels, (size_t)source_width * source_height *
                         sizeof(uint16_t));
    cache_clean(scaled_framebuffer,
                RETRO_GO_DISPLAY_SCALE_STRIDE_PIXELS * target_height *
                    sizeof(uint16_t));
    status = vg_lite_identity(&matrix);
    if (status == VG_LITE_SUCCESS)
    {
        status = vg_lite_scale((vg_lite_float_t)target_width /
                                   (vg_lite_float_t)source_width,
                               (vg_lite_float_t)target_height /
                                   (vg_lite_float_t)source_height,
                               &matrix);
    }
    if (status == VG_LITE_SUCCESS)
    {
        status = vg_lite_blit(&target, &source, &matrix,
                              VG_LITE_BLEND_NONE, 0u,
                              VG_LITE_FILTER_POINT);
    }
    if (status == VG_LITE_SUCCESS)
    {
        status = vg_lite_finish();
    }
    if (status != VG_LITE_SUCCESS)
    {
        if (!vglite_failed)
        {
            rt_kprintf("[retro-go] VG-Lite scale failed: %d; CPU fallback\n",
                       status);
            vglite_failed = true;
        }
        return false;
    }

    cache_invalidate(scaled_framebuffer,
                     RETRO_GO_DISPLAY_SCALE_STRIDE_PIXELS * target_height *
                         sizeof(uint16_t));
    return true;
#else
    (void)pixels;
    (void)source_width;
    (void)source_height;
    (void)target_width;
    (void)target_height;
    return false;
#endif
}

static bool scale_gba_vglite_direct(const uint16_t *pixels)
{
#if defined(BSP_RETRO_GO_USE_VGLITE) && \
    defined(BSP_RETRO_GO_GBA_DIRECT_RENDER)
    vg_lite_buffer_t source;
    vg_lite_buffer_t target;
    vg_lite_matrix_t matrix;
    vg_lite_error_t status;

    if (direct_render_failed || vglite_failed || pixels == NULL ||
        lcd_info.framebuffer == RT_NULL || lcd_info.width < 800u ||
        lcd_info.height < RETRO_GO_GBA_OUTPUT_HEIGHT ||
        lcd_info.pitch < lcd_info.width * sizeof(uint16_t))
    {
        return false;
    }
    memset(&source, 0, sizeof(source));
    source.width = RETRO_GO_GBA_WIDTH;
    source.height = RETRO_GO_GBA_HEIGHT;
    source.stride = RETRO_GO_GBA_WIDTH * sizeof(uint16_t);
    source.format = VG_LITE_RGB565;
    source.tiled = VG_LITE_LINEAR;
    source.image_mode = VG_LITE_NORMAL_IMAGE_MODE;
    source.transparency_mode = VG_LITE_IMAGE_OPAQUE;
    source.memory = (void *)pixels;
    source.address = (uint32_t)(uintptr_t)pixels;

    memset(&target, 0, sizeof(target));
    target.width = lcd_info.width;
    target.height = lcd_info.height;
    target.stride = lcd_info.pitch;
    target.format = VG_LITE_RGB565;
    target.tiled = VG_LITE_LINEAR;
    target.image_mode = VG_LITE_NORMAL_IMAGE_MODE;
    target.transparency_mode = VG_LITE_IMAGE_OPAQUE;
    target.memory = lcd_info.framebuffer;
    target.address = (uint32_t)(uintptr_t)lcd_info.framebuffer;

    cache_clean(pixels, RETRO_GO_GBA_WIDTH * RETRO_GO_GBA_HEIGHT *
                         sizeof(uint16_t));
    cache_clean(lcd_info.framebuffer,
                (size_t)lcd_info.pitch * lcd_info.height);
    status = vg_lite_identity(&matrix);
    if (status == VG_LITE_SUCCESS)
    {
        status = vg_lite_scale((vg_lite_float_t)RETRO_GO_GBA_SCALE,
                               (vg_lite_float_t)RETRO_GO_GBA_SCALE,
                               &matrix);
    }
    if (status == VG_LITE_SUCCESS)
    {
        status = vg_lite_blit(&target, &source, &matrix,
                              VG_LITE_BLEND_NONE, 0u,
                              VG_LITE_FILTER_POINT);
    }
    if (status == VG_LITE_SUCCESS)
    {
        status = vg_lite_finish();
    }
    if (status != VG_LITE_SUCCESS)
    {
        direct_render_failed = true;
        rt_kprintf("[retro-go] direct GBA render failed: %d; staging fallback\n",
                   status);
        return false;
    }
    cache_invalidate(lcd_info.framebuffer,
                     (size_t)lcd_info.pitch * lcd_info.height);
    if (!direct_render_logged)
    {
        direct_render_logged = true;
        rt_kprintf("[retro-go] GBA direct VG-Lite render active: target=%p "
                   "stride=%u\n", lcd_info.framebuffer, lcd_info.pitch);
    }
    return true;
#else
    (void)pixels;
    return false;
#endif
}

static vg_lite_error_t build_direct_scanout_matrix(
    vg_lite_matrix_t *matrix,
    uint32_t source_width, uint32_t source_height,
    uint32_t logical_x, uint32_t logical_y,
    uint32_t logical_width, uint32_t logical_height)
{
    vg_lite_float_point4_t source;
    vg_lite_float_point4_t destination;

