Rbb666/sdk-bsp-psoc_e84-edgi-talk/projects/Edgi_Talk_M55_RetroGo/applications/retro_go/platform/retro_go_display.c
    source[0].x = 0.0f;
    source[0].y = 0.0f;
    source[1].x = (vg_lite_float_t)source_width;
    source[1].y = 0.0f;
    source[2].x = (vg_lite_float_t)source_width;
    source[2].y = (vg_lite_float_t)source_height;
    source[3].x = 0.0f;
    source[3].y = (vg_lite_float_t)source_height;

#if defined(BSP_LCD_ROTATION_90)
    destination[0].x = (vg_lite_float_t)(RETRO_GO_SCANOUT_WIDTH - logical_y);
    destination[0].y = (vg_lite_float_t)logical_x;
    destination[1].x = destination[0].x;
    destination[1].y = (vg_lite_float_t)(logical_x + logical_width);
    destination[2].x = (vg_lite_float_t)(RETRO_GO_SCANOUT_WIDTH -
                                          logical_y - logical_height);
    destination[2].y = destination[1].y;
    destination[3].x = destination[2].x;
    destination[3].y = destination[0].y;
#else
    destination[0].x = (vg_lite_float_t)logical_y;
    destination[0].y = (vg_lite_float_t)(RETRO_GO_SCANOUT_HEIGHT - logical_x);
    destination[1].x = destination[0].x;
    destination[1].y = (vg_lite_float_t)(RETRO_GO_SCANOUT_HEIGHT -
                                          logical_x - logical_width);
    destination[2].x = (vg_lite_float_t)(logical_y + logical_height);
    destination[2].y = destination[1].y;
    destination[3].x = destination[2].x;
    destination[3].y = destination[0].y;
#endif
    vg_lite_identity(matrix);
    return vg_lite_get_transform_matrix(source, destination, matrix);
}

#ifdef BSP_RETRO_GO_GBA_DIRECT_SCANOUT
static void direct_scanout_reset(void)
{
    direct_scanout_initialized = false;
    direct_scanout_flip_pending = false;
    direct_scanout_front = 0u;
    direct_scanout_back = 1u;
    direct_scanout_pending_front = 0u;
    direct_scanout_buffers[0] = NULL;
    direct_scanout_buffers[1] = NULL;
    direct_scanout_buffer_cleared[0] = false;
    direct_scanout_buffer_cleared[1] = false;
    memset(&direct_scanout_context, 0, sizeof(direct_scanout_context));
#ifdef BSP_RETRO_GO_PERF_OVERLAY
    direct_panel_revision = 1u;
    direct_panel_applied_revision[0] = 0u;
    direct_panel_applied_revision[1] = 0u;
#endif
}

static bool direct_scanout_poll_flip(uint32_t timeout_ms)
{
    if (!direct_scanout_flip_pending)
    {
        return true;
    }
    if (lcd_wait_frame_done(timeout_ms) != RT_EOK)
    {
        return false;
    }
    direct_scanout_front = direct_scanout_pending_front;
    direct_scanout_back = (uint8_t)(1u - direct_scanout_front);
    direct_scanout_flip_pending = false;
    return true;
}

static bool direct_scanout_restore_vendor_buffer(void)
{
    rt_base_t level;
    cy_en_gfx_status_t status;

    if (!direct_scanout_initialized || direct_scanout_buffers[0] == NULL)
    {
        return true;
    }
    level = rt_hw_interrupt_disable();
    while (lcd_wait_frame_done(0u) == RT_EOK)
    {
    }
    status = Cy_GFXSS_Set_FrameBuffer(
        (GFXSS_Type *)GFXSS,
        (uint32_t *)direct_scanout_buffers[0],
        &direct_scanout_context);
    Cy_GFXSS_Clear_DC_Interrupt(
        (GFXSS_Type *)GFXSS, &direct_scanout_context);
    NVIC_ClearPendingIRQ(GFXSS_DC_IRQ);
    rt_hw_interrupt_enable(level);
    if (status != CY_GFX_SUCCESS || lcd_wait_frame_done(50u) != RT_EOK)
    {
        rt_kprintf("[retro-go] vendor scanout restore failed: status=%d\n",
                   status);
        return false;
    }
    direct_scanout_front = 0u;
    direct_scanout_back = 1u;
    direct_scanout_flip_pending = false;
    return true;
}

static bool direct_scanout_enter_vendor_path(void)
{
    if (direct_scanout_initialized &&
        !direct_scanout_restore_vendor_buffer())
    {
        return false;
    }
    direct_scanout_reset();
    return true;
}
#endif

static bool scale_gba_vglite_scanout(const uint16_t *pixels)
{
#if defined(BSP_RETRO_GO_USE_VGLITE) && \
    defined(BSP_RETRO_GO_GBA_DIRECT_SCANOUT)
    vg_lite_buffer_t source;
    vg_lite_buffer_t target;
    vg_lite_matrix_t matrix;
    vg_lite_error_t status;
    uint32_t scanout_stride;
    uint16_t *scanout;
    uintptr_t scanout_start;
    uintptr_t scanout_end;
    uint32_t game_logical_x;
#ifdef BSP_RETRO_GO_PERF_OVERLAY
    bool panel_blitted = false;
#endif

    if (direct_scanout_failed || vglite_failed || pixels == NULL ||
        lcd_info.width != RETRO_GO_SCANOUT_HEIGHT ||
        lcd_info.height != RETRO_GO_SCANOUT_WIDTH)
    {
        return false;
    }
    if (!direct_scanout_initialized)
    {
        scanout = (uint16_t *)Cy_GFXSS_Get_FrameBufferAddress(
            (GFXSS_Type *)GFXSS);
        scanout_stride =
            GFXSS->GFXSS_DC.DCNANO.GCREGFRAMEBUFFERSTRIDE;
        scanout_start = (uintptr_t)scanout;
        scanout_end = scanout_start +
            (uintptr_t)scanout_stride * RETRO_GO_SCANOUT_HEIGHT;
        if (scanout == NULL ||
            scanout_stride !=
                RETRO_GO_SCANOUT_STRIDE_PIXELS * sizeof(uint16_t) ||
            scanout_start < RETRO_GO_GFXRAM_START ||
            scanout_end > RETRO_GO_GFXRAM_END ||
            scanout_end <= scanout_start)
        {
            direct_scanout_failed = true;
            rt_kprintf("[retro-go] direct scanout contract mismatch: fb=%p "
                       "stride=%u\n", scanout, (unsigned)scanout_stride);
            return false;
        }
        direct_scanout_buffers[0] = scanout;
        direct_scanout_buffers[1] = display_work_buffer.scanout;
        direct_scanout_front = 0u;
        direct_scanout_back = 1u;
        direct_scanout_flip_pending = false;
        direct_scanout_initialized = true;
        direct_scanout_buffer_cleared[0] = true;
        direct_scanout_buffer_cleared[1] = false;
        memset(&direct_scanout_context, 0,
               sizeof(direct_scanout_context));
    }
    if (!direct_scanout_poll_flip(BSP_RETRO_GO_GBA_FLIP_WAIT_MS))
    {
        ++display_dropped_frames;
        display_present_completed = false;
        return true;
    }
    scanout = direct_scanout_buffers[direct_scanout_back];
    scanout_stride = RETRO_GO_SCANOUT_STRIDE_PIXELS * sizeof(uint16_t);
    scanout_start = (uintptr_t)scanout;

