Rbb666/sdk-bsp-psoc_e84-edgi-talk/projects/Edgi_Talk_M55_RetroGo/applications/retro_go/platform/retro_go_display.c
    memset(&source, 0, sizeof(source));
    source.width = RETRO_GO_GBA_WIDTH;
    source.height = RETRO_GO_GBA_HEIGHT;
    source.stride = RETRO_GO_GBA_WIDTH * sizeof(uint16_t);
    source.format = VG_LITE_RGB565;
    source.tiled = VG_LITE_LINEAR;
    source.image_mode = VG_LITE_NORMAL_IMAGE_MODE;
    source.transparency_mode = VG_LITE_IMAGE_OPAQUE;
    source.memory = (void *)pixels;
    source.address = (uint32_t)(uintptr_t)pixels;

    memset(&target, 0, sizeof(target));
    target.width = RETRO_GO_SCANOUT_WIDTH;
    target.height = RETRO_GO_SCANOUT_HEIGHT;
    target.stride = scanout_stride;
    target.format = VG_LITE_RGB565;
    target.tiled = VG_LITE_LINEAR;
    target.image_mode = VG_LITE_NORMAL_IMAGE_MODE;
    target.transparency_mode = VG_LITE_IMAGE_OPAQUE;
    target.memory = scanout;
    target.address = (uint32_t)scanout_start;

#ifdef BSP_RETRO_GO_PERF_OVERLAY
    game_logical_x = 0u;
#else
    game_logical_x =
        (lcd_info.width - RETRO_GO_GBA_OUTPUT_WIDTH) / 2u;
#endif
    cache_clean(pixels, RETRO_GO_GBA_WIDTH * RETRO_GO_GBA_HEIGHT *
                         sizeof(uint16_t));
    status = direct_scanout_buffer_cleared[direct_scanout_back] ?
        VG_LITE_SUCCESS : vg_lite_clear(&target, NULL, 0u);
    if (status == VG_LITE_SUCCESS)
    {
        status = build_direct_scanout_matrix(
            &matrix, RETRO_GO_GBA_WIDTH, RETRO_GO_GBA_HEIGHT,
            game_logical_x, 0u, RETRO_GO_GBA_OUTPUT_WIDTH,
            RETRO_GO_GBA_OUTPUT_HEIGHT);
    }
    if (status == VG_LITE_SUCCESS)
    {
        status = vg_lite_blit(&target, &source, &matrix,
                              VG_LITE_BLEND_NONE, 0u,
                              VG_LITE_FILTER_POINT);
    }
#ifdef BSP_RETRO_GO_PERF_OVERLAY
    if (retro_go_perf_render_due(
            launcher_framebuffer, RETRO_GO_PERF_PANEL_WIDTH,
            RETRO_GO_PERF_PANEL_HEIGHT, RETRO_GO_PERF_PANEL_WIDTH))
    {
        ++direct_panel_revision;
        if (direct_panel_revision == 0u)
        {
            direct_panel_revision = 1u;
            direct_panel_applied_revision[0] = 0u;
            direct_panel_applied_revision[1] = 0u;
        }
    }
    if (status == VG_LITE_SUCCESS &&
        direct_panel_applied_revision[direct_scanout_back] !=
            direct_panel_revision)
    {
        source.width = RETRO_GO_PERF_PANEL_WIDTH;
        source.height = RETRO_GO_PERF_PANEL_HEIGHT;
        source.stride = RETRO_GO_PERF_PANEL_WIDTH * sizeof(uint16_t);
        source.memory = launcher_framebuffer;
        source.address = (uint32_t)(uintptr_t)launcher_framebuffer;
        cache_clean(launcher_framebuffer,
                    RETRO_GO_PERF_PANEL_WIDTH *
                    RETRO_GO_PERF_PANEL_HEIGHT * sizeof(uint16_t));
        status = build_direct_scanout_matrix(
            &matrix, RETRO_GO_PERF_PANEL_WIDTH,
            RETRO_GO_PERF_PANEL_HEIGHT,
            lcd_info.width - RETRO_GO_PERF_PANEL_WIDTH, 0u,
            RETRO_GO_PERF_PANEL_WIDTH, RETRO_GO_PERF_PANEL_HEIGHT);
        if (status == VG_LITE_SUCCESS)
        {
            status = vg_lite_blit(&target, &source, &matrix,
                                  VG_LITE_BLEND_NONE, 0u,
                                  VG_LITE_FILTER_POINT);
            panel_blitted = status == VG_LITE_SUCCESS;
        }
    }
#endif
    if (status == VG_LITE_SUCCESS)
    {
        status = vg_lite_finish();
    }
    if (status != VG_LITE_SUCCESS)
    {
        direct_scanout_failed = true;
        (void)direct_scanout_restore_vendor_buffer();
        rt_kprintf("[retro-go] direct GBA scanout failed: %d; "
                   "staging fallback\n", status);
        return false;
    }
    cache_invalidate(scanout, scanout_stride * RETRO_GO_SCANOUT_HEIGHT);
    {
        rt_base_t level = rt_hw_interrupt_disable();
        cy_en_gfx_status_t flip_status;

        while (lcd_wait_frame_done(0u) == RT_EOK)
        {
        }
        flip_status = Cy_GFXSS_Set_FrameBuffer(
            (GFXSS_Type *)GFXSS, (uint32_t *)scanout,
            &direct_scanout_context);
        /* Discard an IRQ which raced with the commit. The next DC interrupt
         * is therefore guaranteed to occur after this buffer was submitted. */
        Cy_GFXSS_Clear_DC_Interrupt(
            (GFXSS_Type *)GFXSS, &direct_scanout_context);
        NVIC_ClearPendingIRQ(GFXSS_DC_IRQ);
        if (flip_status == CY_GFX_SUCCESS)
        {
            direct_scanout_buffer_cleared[direct_scanout_back] = true;
#ifdef BSP_RETRO_GO_PERF_OVERLAY
            if (panel_blitted)
            {
                direct_panel_applied_revision[direct_scanout_back] =
                    direct_panel_revision;
            }
#endif
            direct_scanout_pending_front = direct_scanout_back;
            direct_scanout_flip_pending = true;
        }
        rt_hw_interrupt_enable(level);
        if (flip_status != CY_GFX_SUCCESS)
        {
            direct_scanout_failed = true;
            (void)direct_scanout_restore_vendor_buffer();
            rt_kprintf("[retro-go] direct GBA scanout flip failed; "
                       "staging fallback\n");
            return false;
        }
    }
    if (!direct_scanout_logged)
    {
        direct_scanout_logged = true;
        rt_kprintf("[retro-go] direct GBA VG-Lite scanout active: "
                   "fb=%p stride=%u, no display worker\n",
                   scanout, (unsigned)scanout_stride);
    }
    return true;
#else
    (void)pixels;
    return false;
#endif
}

static RETRO_GO_ITCM bool present_cpu(const uint16_t *pixels)
{
    uint16_t previous_source_y = UINT16_MAX;
    uint16_t y;

    if (pixels == NULL || viewport.width == 0u || viewport.height == 0u ||
        viewport.width > RETRO_GO_DISPLAY_MAX_VIEWPORT_WIDTH ||
        viewport.height > RETRO_GO_DISPLAY_MAX_HEIGHT)
    {
        return false;
    }

    for (y = 0u; y < viewport.height; ++y)
    {
        const uint16_t *source_row =
            pixels + (size_t)source_y_map[y] * RETRO_GO_GB_WIDTH;
        uint16_t *destination_row =
            scaled_framebuffer +
            (size_t)y * RETRO_GO_DISPLAY_SCALE_STRIDE_PIXELS;

        if (y != 0u && source_y_map[y] == previous_source_y)
        {
            memcpy(destination_row,
                   destination_row - RETRO_GO_DISPLAY_SCALE_STRIDE_PIXELS,
                   viewport.width * sizeof(destination_row[0]));
        }
        else
        {
            uint16_t x;

            for (x = 0u; x < viewport.width; ++x)
            {
                destination_row[x] = source_row[source_x_map[x]];
            }
        }
        previous_source_y = source_y_map[y];
    }

