Rbb666/sdk-bsp-psoc_e84-edgi-talk/projects/Edgi_Talk_M55_RetroGo/applications/retro_go/platform/retro_go_display.c
    lcd_flush_rgb565_area(scaled_framebuffer, viewport.x, viewport.y,
                          viewport.width, viewport.height,
                          RETRO_GO_DISPLAY_SCALE_STRIDE_PIXELS,
                          RT_TRUE);
    return true;
}

#ifdef BSP_RETRO_GO_ASYNC_GBA_DISPLAY
static void display_thread_entry(void *parameter)
{
    (void)parameter;
    for (;;)
    {
        if (rt_sem_take(&display_sem, RT_WAITING_FOREVER) != RT_EOK)
        {
            continue;
        }
        for (;;)
        {
            uint32_t started_cycles;
            uint32_t elapsed_cycles;
            rt_base_t level;
            int buffer = -1;
            bool success;
            unsigned index;

            level = rt_hw_interrupt_disable();
            for (index = 0u; index < RETRO_GO_GBA_MAILBOX_BUFFERS; ++index)
            {
                if (display_buffer_state[index] ==
                    RETRO_GO_DISPLAY_BUFFER_READY)
                {
                    display_buffer_state[index] =
                        RETRO_GO_DISPLAY_BUFFER_DISPLAYING;
                    buffer = (int)index;
                    break;
                }
            }
            if (buffer < 0)
            {
                display_worker_running = false;
                display_async_busy = false;
                for (index = 0u;
                     index < RETRO_GO_GBA_MAILBOX_BUFFERS; ++index)
                {
                    if (display_buffer_state[index] !=
                        RETRO_GO_DISPLAY_BUFFER_FREE)
                    {
                        display_async_busy = true;
                        break;
                    }
                }
                rt_hw_interrupt_enable(level);
                break;
            }
            rt_hw_interrupt_enable(level);

            started_cycles = retro_go_time_now_cycles();
            success = present_gba_sync(gba_present_framebuffer[buffer]);
            elapsed_cycles = retro_go_time_elapsed_cycles(started_cycles);

            level = rt_hw_interrupt_disable();
            display_buffer_state[buffer] = RETRO_GO_DISPLAY_BUFFER_FREE;
            if (success)
            {
                ++display_completed_frames;
                display_total_present_cycles += elapsed_cycles;
                if (elapsed_cycles > display_max_present_cycles)
                {
                    display_max_present_cycles = elapsed_cycles;
                }
            }
            else
            {
                ++display_failed_frames;
            }
            rt_hw_interrupt_enable(level);
        }
    }
}

static bool start_async_display(void)
{
    rt_err_t result;

    display_async_ready = false;
    display_async_busy = false;
    display_worker_running = false;
    memset((void *)display_buffer_state, RETRO_GO_DISPLAY_BUFFER_FREE,
           sizeof(display_buffer_state));
    display_submitted_frames = 0u;
    display_completed_frames = 0u;
    display_dropped_frames = 0u;
    display_failed_frames = 0u;
    display_total_present_cycles = 0u;
    display_max_present_cycles = 0u;
    result = rt_sem_init(&display_sem, "rg_disp", 0u, RT_IPC_FLAG_FIFO);
    if (result != RT_EOK)
    {
        return false;
    }
    result = rt_thread_init(
        &display_thread, "rg_disp", display_thread_entry, RT_NULL,
        display_thread_stack, sizeof(display_thread_stack),
        BSP_RETRO_GO_DISPLAY_THREAD_PRIORITY,
        BSP_RETRO_GO_DISPLAY_THREAD_SLICE);
    if (result != RT_EOK)
    {
        (void)rt_sem_detach(&display_sem);
        return false;
    }
    result = rt_thread_startup(&display_thread);
    if (result != RT_EOK)
    {
        (void)rt_thread_detach(&display_thread);
        (void)rt_sem_detach(&display_sem);
        return false;
    }
    display_async_ready = true;
    rt_kprintf("[retro-go] async GBA display ready: priority=%u slice=%u, "
               "latest-mailbox=%ux%u bytes\n",
               BSP_RETRO_GO_DISPLAY_THREAD_PRIORITY,
               BSP_RETRO_GO_DISPLAY_THREAD_SLICE,
               RETRO_GO_GBA_MAILBOX_BUFFERS,
               (unsigned)sizeof(gba_present_framebuffer[0]));
    return true;
}
#endif

bool retro_go_display_init(void)
{
    unsigned vglite_enabled = 0u;
    unsigned perf_panel_width = 0u;

    lcd_device = rt_device_find("lcd");
    if (lcd_device == RT_NULL)
    {
        rt_kprintf("[retro-go] lcd device not found\n");
        return false;
    }
    memset(&lcd_info, 0, sizeof(lcd_info));
    if (rt_device_control(lcd_device, RTGRAPHIC_CTRL_GET_INFO,
                          &lcd_info) != RT_EOK ||
        lcd_info.framebuffer == RT_NULL || lcd_info.bits_per_pixel != 16u ||
        lcd_info.width > RETRO_GO_DISPLAY_MAX_WIDTH ||
        lcd_info.height > RETRO_GO_DISPLAY_MAX_HEIGHT)
    {
        rt_kprintf("[retro-go] unsupported lcd framebuffer\n");
        return false;
    }

    viewport = calculate_viewport(lcd_info.width, lcd_info.height);
    build_scale_maps();
    memset(source_framebuffer, 0, sizeof(source_framebuffer));
    memset(launcher_framebuffer, 0, sizeof(launcher_framebuffer));
    memset(gba_framebuffer, 0, sizeof(gba_framebuffer));
    display_submitted_frames = 0u;
    display_completed_frames = 0u;
    display_dropped_frames = 0u;
    display_failed_frames = 0u;
    display_total_present_cycles = 0u;
    display_max_present_cycles = 0u;
    display_ready = true;
#ifdef BSP_RETRO_GO_USE_VGLITE
    vglite_enabled = 1u;
#endif
#ifdef BSP_RETRO_GO_PERF_OVERLAY
    perf_panel_width = RETRO_GO_PERF_PANEL_WIDTH;
#endif
    rt_kprintf("[retro-go] display %ux%u pitch=%u fb=%p, viewport %u,%u "
               "%ux%u, vglite-scaler=%d, perf-panel=%u\n",
               lcd_info.width, lcd_info.height, lcd_info.pitch,
               lcd_info.framebuffer, viewport.x, viewport.y,
               viewport.width, viewport.height, vglite_enabled,
               perf_panel_width);
    if (!present_cpu(source_framebuffer))
    {
        rt_kprintf("[retro-go] display clear failed\n");
        display_ready = false;
        return false;
    }
#ifdef BSP_RETRO_GO_ASYNC_GBA_DISPLAY
    if (!start_async_display())
    {
        rt_kprintf("[retro-go] async display init failed; synchronous fallback\n");
    }
#endif
    return true;
}

uint16_t *retro_go_display_framebuffer(void)
{
    return source_framebuffer;
}

uint16_t *retro_go_display_launcher_framebuffer(void)
{
    return launcher_framebuffer;
}

uint16_t *retro_go_display_gba_framebuffer(void)
{
    return gba_framebuffer;
}

