Rbb666/sdk-bsp-psoc_e84-edgi-talk/projects/Edgi_Talk_M55_RetroGo/applications/retro_go/platform/retro_go_display.c
static bool present_gba_sync(const uint16_t *framebuffer)
{
    uint32_t destination_x;
    uint16_t y;

    if (!display_ready || framebuffer == NULL ||
        lcd_info.width < RETRO_GO_GBA_OUTPUT_WIDTH ||
        lcd_info.height < RETRO_GO_GBA_OUTPUT_HEIGHT)
    {
        return false;
    }
    display_present_completed = true;
#ifdef BSP_RETRO_GO_PERF_OVERLAY
    destination_x = 0u;
#else
    destination_x = (lcd_info.width - RETRO_GO_GBA_OUTPUT_WIDTH) / 2u;
#endif
    if (scale_gba_vglite_scanout(framebuffer))
    {
        retro_go_perf_set_vglite(true);
        return true;
    }
    if (scale_gba_cpu_direct(framebuffer))
    {
        static bool cpu_direct_logged;

        stage_performance_panel();
        if (!cpu_direct_logged)
        {
            cpu_direct_logged = true;
            rt_kprintf("[retro-go] GBA direct CPU 3x scaler active\n");
        }
        return rt_device_control(lcd_device, RTGRAPHIC_CTRL_RECT_UPDATE,
                                 RT_NULL) == RT_EOK;
    }
    if (scale_gba_vglite_direct(framebuffer))
    {
        retro_go_perf_set_vglite(true);
        stage_performance_panel();
        return rt_device_control(lcd_device, RTGRAPHIC_CTRL_RECT_UPDATE,
                                 RT_NULL) == RT_EOK;
    }
    if (scale_vglite(framebuffer, RETRO_GO_GBA_WIDTH,
                     RETRO_GO_GBA_HEIGHT, RETRO_GO_GBA_OUTPUT_WIDTH,
                     RETRO_GO_GBA_OUTPUT_HEIGHT))
    {
        retro_go_perf_set_vglite(true);
        stage_performance_panel();
        lcd_flush_rgb565_area(scaled_framebuffer, destination_x, 0u,
                              RETRO_GO_GBA_OUTPUT_WIDTH,
                              RETRO_GO_GBA_OUTPUT_HEIGHT,
                              RETRO_GO_DISPLAY_SCALE_STRIDE_PIXELS, RT_TRUE);
        return true;
    }
    retro_go_perf_set_vglite(false);
    for (y = 0u; y < RETRO_GO_GBA_HEIGHT; ++y)
    {
        const uint16_t *source_row =
            framebuffer + (size_t)y * RETRO_GO_GBA_WIDTH;
        uint16_t *first_row =
            scaled_framebuffer +
            (size_t)(y * RETRO_GO_GBA_SCALE) *
                RETRO_GO_DISPLAY_SCALE_STRIDE_PIXELS;
        uint16_t x;

        for (x = 0u; x < RETRO_GO_GBA_WIDTH; ++x)
        {
            uint16_t pixel = source_row[x];
            size_t output = (size_t)x * RETRO_GO_GBA_SCALE;

            first_row[output] = pixel;
            first_row[output + 1u] = pixel;
            first_row[output + 2u] = pixel;
        }
        memcpy(first_row + RETRO_GO_DISPLAY_SCALE_STRIDE_PIXELS,
               first_row,
               RETRO_GO_GBA_OUTPUT_WIDTH * sizeof(first_row[0]));
        memcpy(first_row + RETRO_GO_DISPLAY_SCALE_STRIDE_PIXELS * 2u,
               first_row,
               RETRO_GO_GBA_OUTPUT_WIDTH * sizeof(first_row[0]));
    }
    stage_performance_panel();
    lcd_flush_rgb565_area(scaled_framebuffer, destination_x, 0u,
                          RETRO_GO_GBA_OUTPUT_WIDTH,
                          RETRO_GO_GBA_OUTPUT_HEIGHT,
                          RETRO_GO_DISPLAY_SCALE_STRIDE_PIXELS, RT_TRUE);
    return true;
}

bool retro_go_display_present_gba(const uint16_t *framebuffer)
{
#ifdef BSP_RETRO_GO_ASYNC_GBA_DISPLAY
    rt_base_t level;

    if (display_async_ready)
    {
        if (!display_ready || framebuffer == NULL)
        {
            return false;
        }
        level = rt_hw_interrupt_disable();
        {
            int target = -1;
            bool replacing = false;
            bool wake_worker = false;
            unsigned index;

            /* Prefer replacing an unclaimed READY frame. This keeps the
             * mailbox latency-bounded even if the producer preempts the
             * lower-priority worker between two presents. */
            for (index = 0u;
                 index < RETRO_GO_GBA_MAILBOX_BUFFERS; ++index)
            {
                if (display_buffer_state[index] ==
                    RETRO_GO_DISPLAY_BUFFER_READY)
                {
                    target = (int)index;
                    replacing = true;
                    break;
                }
            }
            if (target < 0)
            {
                for (index = 0u;
                     index < RETRO_GO_GBA_MAILBOX_BUFFERS; ++index)
                {
                    if (display_buffer_state[index] ==
                        RETRO_GO_DISPLAY_BUFFER_FREE)
                    {
                        target = (int)index;
                        break;
                    }
                }
            }
            if (target < 0)
            {
                ++display_dropped_frames;
                rt_hw_interrupt_enable(level);
                return false;
            }
            display_buffer_state[target] = RETRO_GO_DISPLAY_BUFFER_WRITING;
            display_async_busy = true;
            if (replacing)
            {
                ++display_dropped_frames;
            }
            rt_hw_interrupt_enable(level);

            memcpy(gba_present_framebuffer[target], framebuffer,
                   sizeof(gba_present_framebuffer[target]));

            level = rt_hw_interrupt_disable();
            display_buffer_state[target] = RETRO_GO_DISPLAY_BUFFER_READY;
            ++display_submitted_frames;
            if (!display_worker_running)
            {
                display_worker_running = true;
                wake_worker = true;
            }
            rt_hw_interrupt_enable(level);
            if (wake_worker)
            {
                (void)rt_sem_release(&display_sem);
            }
            return true;
        }
    }
#endif
    {
        uint32_t started_cycles = retro_go_time_now_cycles();
        bool success;
        uint32_t elapsed_cycles;
        rt_base_t level;

        ++display_submitted_frames;
        success = present_gba_sync(framebuffer);
        elapsed_cycles = retro_go_time_elapsed_cycles(started_cycles);
        level = rt_hw_interrupt_disable();
        if (success && display_present_completed)
        {
            ++display_completed_frames;
            display_total_present_cycles += elapsed_cycles;
            if (elapsed_cycles > display_max_present_cycles)
            {
                display_max_present_cycles = elapsed_cycles;
            }
        }
        else if (!success)
        {
            ++display_failed_frames;
        }
        rt_hw_interrupt_enable(level);
        return success;
    }
}

bool retro_go_display_can_accept_gba(void)
{
#ifdef BSP_RETRO_GO_GBA_DIRECT_SCANOUT
    if (direct_scanout_initialized && !direct_scanout_failed &&
        !direct_scanout_poll_flip(0u))
    {
        return false;
    }
#endif
#ifdef BSP_RETRO_GO_ASYNC_GBA_DISPLAY
    if (display_async_ready)
    {
        /* A READY snapshot can be atomically replaced with the newest frame
         * while the worker owns the DISPLAYING slot. Rendering is therefore
         * no longer suppressed merely because present is slower than 60 Hz. */
        return true;
    }
#endif
    return true;
}

