Rbb666/sdk-bsp-psoc_e84-edgi-talk/projects/Edgi_Talk_M55_RetroGo/applications/retro_go/platform/retro_go_display.c
bool retro_go_display_gba_busy(void)
{
#ifdef BSP_RETRO_GO_GBA_DIRECT_SCANOUT
    if (direct_scanout_initialized && !direct_scanout_failed &&
        !direct_scanout_poll_flip(0u))
    {
        return true;
    }
#endif
#ifdef BSP_RETRO_GO_ASYNC_GBA_DISPLAY
    return display_async_ready && display_async_busy;
#else
    return false;
#endif
}

bool retro_go_display_wait_gba_idle(uint32_t timeout_ms)
{
    uint32_t started_ms = rt_tick_get_millisecond();

    while (retro_go_display_gba_busy())
    {
        if ((uint32_t)(rt_tick_get_millisecond() - started_ms) >= timeout_ms)
        {
            return false;
        }
        rt_thread_mdelay(1u);
    }
    return true;
}

void retro_go_display_get_stats(retro_go_display_stats_t *stats)
{
    rt_base_t level;

    if (stats == NULL)
    {
        return;
    }
    memset(stats, 0, sizeof(*stats));
    level = rt_hw_interrupt_disable();
    stats->submitted_frames = display_submitted_frames;
    stats->completed_frames = display_completed_frames;
    stats->dropped_frames = display_dropped_frames;
    stats->failed_frames = display_failed_frames;
    stats->total_present_cycles = display_total_present_cycles;
    stats->max_present_cycles = display_max_present_cycles;
    stats->busy = false;
#ifdef BSP_RETRO_GO_ASYNC_GBA_DISPLAY
    stats->busy = display_async_ready && display_async_busy;
#endif
    rt_hw_interrupt_enable(level);
}

bool retro_go_display_present_launcher(const uint16_t *framebuffer)
{
    uint32_t destination_x;
    uint32_t destination_y;
    uint16_t y;

    if (!display_ready || framebuffer == NULL ||
        lcd_info.width < RETRO_GO_LAUNCHER_OUTPUT_WIDTH ||
        lcd_info.height < RETRO_GO_LAUNCHER_OUTPUT_HEIGHT)
    {
        return false;
    }
#ifdef BSP_RETRO_GO_GBA_DIRECT_SCANOUT
    /* The work-buffer union may currently be the physical front buffer.
     * Restore the vendor-owned scanout before writing launcher pixels into
     * that memory, then forget the game-only double-buffer state. */
    if (!direct_scanout_enter_vendor_path())
    {
        return false;
    }
#endif
    for (y = 0u; y < RETRO_GO_LAUNCHER_HEIGHT; ++y)
    {
        const uint16_t *source_row =
            framebuffer + (size_t)y * RETRO_GO_LAUNCHER_WIDTH;
        uint16_t *first_row =
            scaled_framebuffer +
            (size_t)(y * RETRO_GO_LAUNCHER_SCALE) *
                RETRO_GO_DISPLAY_SCALE_STRIDE_PIXELS;
        uint16_t x;

        for (x = 0u; x < RETRO_GO_LAUNCHER_WIDTH; ++x)
        {
            uint16_t pixel = source_row[x];
            first_row[x * RETRO_GO_LAUNCHER_SCALE] = pixel;
            first_row[x * RETRO_GO_LAUNCHER_SCALE + 1u] = pixel;
        }
        memcpy(first_row + RETRO_GO_DISPLAY_SCALE_STRIDE_PIXELS,
               first_row,
               RETRO_GO_LAUNCHER_OUTPUT_WIDTH * sizeof(first_row[0]));
    }
    destination_x = (lcd_info.width - RETRO_GO_LAUNCHER_OUTPUT_WIDTH) / 2u;
    destination_y = (lcd_info.height - RETRO_GO_LAUNCHER_OUTPUT_HEIGHT) / 2u;
    lcd_flush_rgb565_area(scaled_framebuffer, destination_x, destination_y,
                          RETRO_GO_LAUNCHER_OUTPUT_WIDTH,
                          RETRO_GO_LAUNCHER_OUTPUT_HEIGHT,
                          RETRO_GO_DISPLAY_SCALE_STRIDE_PIXELS, RT_TRUE);
    return true;
}

void retro_go_display_prepare_game(void)
{
#ifndef BSP_RETRO_GO_PERF_OVERLAY
    uint32_t destination_x;
    uint32_t destination_y;
#endif

    if (!display_ready || lcd_info.width < RETRO_GO_LAUNCHER_OUTPUT_WIDTH ||
        lcd_info.height < RETRO_GO_LAUNCHER_OUTPUT_HEIGHT)
    {
        return;
    }
#ifdef BSP_RETRO_GO_GBA_DIRECT_SCANOUT
    if (!direct_scanout_enter_vendor_path())
    {
        return;
    }
#endif
    memset(scaled_framebuffer, 0, sizeof(scaled_framebuffer));
#ifdef BSP_RETRO_GO_PERF_OVERLAY
    memset(launcher_framebuffer, 0, sizeof(launcher_framebuffer));
    lcd_flush_rgb565_area(
        launcher_framebuffer,
        lcd_info.width - RETRO_GO_PERF_PANEL_WIDTH, 0u,
        RETRO_GO_PERF_PANEL_WIDTH, lcd_info.height,
        RETRO_GO_PERF_PANEL_WIDTH, RT_FALSE);
    lcd_flush_rgb565_area(scaled_framebuffer, 0u, 0u,
                          RETRO_GO_DISPLAY_SCALE_STRIDE_PIXELS,
                          RETRO_GO_DISPLAY_MAX_HEIGHT,
                          RETRO_GO_DISPLAY_SCALE_STRIDE_PIXELS, RT_TRUE);
#else
    destination_x = (lcd_info.width - RETRO_GO_LAUNCHER_OUTPUT_WIDTH) / 2u;
    destination_y = (lcd_info.height - RETRO_GO_LAUNCHER_OUTPUT_HEIGHT) / 2u;
    lcd_flush_rgb565_area(scaled_framebuffer, destination_x, destination_y,
                          RETRO_GO_LAUNCHER_OUTPUT_WIDTH,
                          RETRO_GO_LAUNCHER_OUTPUT_HEIGHT,
                          RETRO_GO_DISPLAY_SCALE_STRIDE_PIXELS, RT_TRUE);
#endif
}

bool retro_go_display_present(const uint16_t *framebuffer)
{
    if (!display_ready || framebuffer == NULL)
    {
        return false;
    }

    if (scale_vglite(framebuffer, RETRO_GO_GB_WIDTH, RETRO_GO_GB_HEIGHT,
                     viewport.width, viewport.height))
    {
        retro_go_perf_set_vglite(true);
        stage_performance_panel();
        lcd_flush_rgb565_area(scaled_framebuffer, viewport.x, viewport.y,
                              viewport.width, viewport.height,
                              RETRO_GO_DISPLAY_SCALE_STRIDE_PIXELS,
                              RT_TRUE);
        return true;
    }
    retro_go_perf_set_vglite(false);
    stage_performance_panel();
    return present_cpu(framebuffer);
}
